Repository: jpupier/4d-component-macro-unicode
Catalog: Unicode/Unicode.4dbase/Resources/*.lproj/UnicodeInputFR.xlf
Languages: fr

source: voice marks
fr: signes vocales

source: diacritical marks
fr: signes diacritiques

source: half marks
fr: signes moitiés

source: symbol marks
fr: signes symboles

source: Latin-1 Supplement
fr: Latin-1 supplémentaire

# insert combining character
source: command+K : insert combining character to text
fr: command+K : Insérer un caractère combinant au texte

# insert latin-1 suppliment
source: command+L : insert Latin-1 supplement to text
fr: command+L : insérer Latin-1 supplémentaire au texte

# view property
source: command+P : view property of selected text
fr: command+P : voir la propriété du texte sélectionné

# insert escaped
source: enter : insert unicode to method - escaped
fr: enter : insérer des caractères Unicode - escaped

# insert base64
source: command+B : insert unicode to method - BASE64
fr: command+B : insérer des caractères Unicode - BASE64

# insert code point
source: command+U : convert hexadecimal to code point
fr: command+U : convertir en hexadécimal à point de code
